[
        {
                "id": "mythtv_enablelivetv",
                "type": "bool",
                "label": "Enable LiveTV",
                "default": "true"
        },
        {
                "id": "mythtv_verbose",
                "type": "bool",
                "label": "Enable extra logging for debuging communitaction with MythTV Server? (/var/log/plex-livetv-feeder.log)",
                "default": "false"
        },
        {
                "id": "mythtv_hostname",
                "type": "text",
                "label": "Host or IP Address of the MythTV Server",
                "default": "localhost"
        },
        {
                "id": "mythtv_category",
                "type": "text",
                "label": "What LiveTV categories to display in 'by category' lists?",
                "default": "Movies,Document,News,Comedy,Sports,Children"
        },
        {
                "id": "mythtv_channel_groups",
                "type": "text",
                "label": "List of MythTV TV Channel Groups to additionally list. Field requires list of TV channel group names defined in mythtv channel groups. Multiple groups names must be comma separated",
                "default": ""
        },
        {
                "id": "programinfocache",
                "type": "text",
                "label": "How many minutes to keep program info before allowing Plex to request update",
                "default": "1"
        },
        {
                "id": "mythtv_srcid_skiplist",
                "type": "text",
                "label": "Which MythTV SourceID (and associated tuners) should be excluded when PLEX is looking for free TV tuner at LiveTV request. This setting is useful when You have some tuners for which requested TV channels are NOT avaliable. Such tuners should be excluded for PLEX. If not excluded - PLEX will show You TV channel avaliable on such tuner and usually not requested by You. Leave empty when all tuners You have have ALL TV channels You may request to watch.",
                "default": ""
        },
        {
                "id": "mythtv_video_codec",
                "type": "text",
                "label": "Which video codec is used by the MythTV Tuner?. Default is 'auto'. If there is issue with playback, set this appropriatelly to video codec used by TV channel broadcaster. Most frequent values are: 'mpeg2video', 'h264' and 'hevc'. For DVB SD in Europe and US ATSC use 'mpeg2video'. For DVB HD in Europe use 'h264'. For UHD use 'hevc'.",
                "default": "auto"
        },
        {
                "id": "mythtv_video_codec2",
                "type": "text",
                "label": "Video codec used by the MythTV Tuner for TV channels listed as channels with alternative video codec.",
                "default": "h264"
        },
        {
                "id": "mythtv_channels_video_codec2",
                "type": "text",
                "label": "Comma separated list of TV channels where alternative video codec must be used.",
                "default": ""
        },
        {
                "id": "mythtv_audio_codec",
                "type": "text",
                "label": "Which audio codec is used by the MythTV Tuner?. Most frequent values are: 'mp2' and 'ac3'. For DVB with Stereo sound use 'mp2'. For DD5.1 sound use 'ac3'",
                "default": "mp2"
        },
        {
                "id": "mythtv_audio_codec2",
                "type": "text",
                "label": "Audio codec used by the MythTV Tuner for TV channels listed as channels with alternative audio codec.",
                "default": "ac3"
        },
        {
                "id": "mythtv_channels_audio_codec2",
                "type": "text",
                "label": "Comma separated list of TV channels where alternative audio codec must be used.",
                "default": ""
        },
        {
                "id": "mythtv_audio_channels",
                "type": "text",
                "label": "What are the max channels the MythTV Tuner will provide?. Default is 'auto'. If there is issue with playback, set this appropriatelly to video codec used by TV channel broadcaster. Usually: set to 2 for Stereo sound and 6 for DD5.1 sound)",
                "default": "auto"
        }
]
